# ResolutionTarget Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingSettings..::..ResolutionTarget Property
RenderingSettings Class See Also
---
The resolution target.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ResolutionTarget ResolutionTarget { get; set; }
```

Visual Basic
---
```text
Public Property ResolutionTarget As ResolutionTarget
	Get
	Set
```

Visual C++
---
```text
public:
property ResolutionTarget ResolutionTarget {
	ResolutionTarget get ();
	void set (ResolutionTarget value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace